app/Controllers/CartController.php

    public function details($id)
    {
        $builder = $this->db->table('products');
        $builder->select('products.*, images.name AS image_name');
        $builder->join('images', 'images.product_id = products.id', 'left');
        $builder->where('products.id', $id);
        $result = $builder->get()->getRow();
---
SELECT `products`.*, `images`.`name` AS `image_name`
FROM `products`
LEFT JOIN `images` ON `images`.`product_id` = `products`.`id`
WHERE `products`.`id` = '17'