app/Controllers/ProductController.php

SELECT `id`, `name`, `image`
FROM `categories`
SELECT `id`, `name`
FROM `subcategories`
SELECT `products`.*, `categories`.`name` as `catname`, `subcategories`.`name` as `subcatname`, `images`.`name` as `imgname`, `categories`.`image` as `catimg`
FROM `products`
INNER JOIN `categories` ON `categories`.`id` = `products`.`category_id`
INNER JOIN `subcategories` ON `subcategories`.`id` = `products`.`subcategory_id`
INNER JOIN `images` ON `images`.`product_id` = `products`.`id`
SELECT `products`.*, `categories`.`name` as `catname`, `subcategories`.`name` as `subcatname`, `images`.`name` as `imgname`, `categories`.`image` as `catimg`
FROM `products`
INNER JOIN `categories` ON `categories`.`id` = `products`.`category_id`
INNER JOIN `subcategories` ON `subcategories`.`id` = `products`.`subcategory_id`
INNER JOIN `images` ON `images`.`product_id` = `products`.`id`
ORDER BY `products`.`id` DESC
 LIMIT 4
---
    public function index()
    {
        $cats = $this->db
            ->table('categories')
            ->select('id, name,image')
            ->get()->getResultArray();

        $subcats = $this->db
            ->table('subcategories')
            ->select('id, name')
            ->get()->getResultArray();

        $builder = $this->db->table('products');
        $builder->select('products.*,categories.name as catname,subcategories.name as subcatname,images.name as imgname,categories.image as catimg');
        $builder->join('categories', 'categories.id = products.category_id', 'inner');
        $builder->join('subcategories', 'subcategories.id = products.subcategory_id', 'inner');
        $builder->join('images', 'images.product_id = products.id', 'inner');
        $data = $builder->get()->getResultArray();
        // dd($data);


        $builder = $this->db->table('products');
        $builder->select('products.*, categories.name as catname, subcategories.name as subcatname, images.name as imgname, categories.image as catimg');
        $builder->join('categories', 'categories.id = products.category_id', 'inner');
        $builder->join('subcategories', 'subcategories.id = products.subcategory_id', 'inner');
        $builder->join('images', 'images.product_id = products.id', 'inner');
        $builder->orderBy('products.id', 'desc');
        $builder->limit(4);
        $data2 = $builder->get()->getResultArray();